In [1]:
import pandas as pd

In [57]:
some_df=pd.read_csv('./data/amazon_men.csv',encoding='unicode_escape')

In [58]:
some_df

,Product Description,Price(Dollar),Number of reviews,Real price(Dollar),Shipment,Delivery Date,How many sell in past month
0,"Vertx Cutback Mens Tactical Shorts 11 inches, ...",62,2,14.00,Ships to Bangladesh,"Thu, Jun 15",10K+ bought in past month
1,"Storelli Jumper Socks by Floky, Biomechanical ...",49,"1,652",22.00,Ships to Bangladesh,"Thu, Jun 15",10K+ bought in past month
2,"Storelli Re-Charge Recovery Socks by Floky, Bi...",49,"259,463",30.00,Ships to Bangladesh,"Thu, Jun 15",6K+ bought in past month
3,Nike Men's Dri-Fit Training Cotton Cushioned C...,25,"52,469",26.00,Ships to Bangladesh,"Thu, Jun 15",10K+ bought in past month
4,"Gildan Men's Crew T-Shirts, Multipack, Style G...",42,"27,762",20.50,Ships to Bangladesh,"Thu, Jun 15",7K+ bought in past month
...,...,...,...,...,...,...,...
23948,Amazon Essentials Men's Corduroy Chino Pants,37,84,None,Ships to Bangladesh,"Wed, Jun 21",100+ bought in past month
23949,Paul Smith Men's Standard Short Long Zebra,NaN,84,None,Ships to Bangladesh,"Wed, Jun 21",100+ bought in past month
23950,Tommy Bahama Long Sleeve Indigo Beach Camp Shirt,NaN,84,None,Ships to Bangladesh,"Wed, Jun 21",100+ bought in past month
23951,Kanu Surf Men's South Beach Swim Trunks (Regul...,NaN,84,None,& Up,"Wed, Jun 21",100+ bought in past month
23952,"Volcom Men's Iconic Stone Fleece 20"" SweatShorts",NaN,84,None,& Up,"Wed, Jun 21",100+ bought in past month

### Information of data frame

In [59]:
some_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23953 entries, 0 to 23952
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Product Description           23953 non-null  object
 1   Price(Dollar)                 22946 non-null  object
 2   Number of reviews             23953 non-null  object
 3   Real price(Dollar)            23953 non-null  object
 4   Shipment                      23953 non-null  object
 5   Delivery Date                 23953 non-null  object
 6   How many sell  in past month  23953 non-null  object
dtypes: object(7)
memory usage: 1.3+ MB

### Overview of data

In [60]:
some_df.describe()

,Product Description,Price(Dollar),Number of reviews,Real price(Dollar),Shipment,Delivery Date,How many sell in past month
count,23953,22946,23953,23953,23953,23953,23953
unique,17013,310,2614,1141,2,4,21
top,Fair Indigo Men's Organic All-Cotton V-Neck Ca...,49,28,None,Ships to Bangladesh,"Mon, Jun 26",50+ bought in past month
freq,402,1894,3321,14298,23720,11260,9453

In [61]:
some_df.columns

Index(['Product Description ', 'Price(Dollar)', 'Number of reviews',
       'Real price(Dollar)', 'Shipment', 'Delivery Date',
       'How many sell  in past month'],
      dtype='object')

In [62]:
some_df.shape

(23953, 7)

In [63]:
some_df

,Product Description,Price(Dollar),Number of reviews,Real price(Dollar),Shipment,Delivery Date,How many sell in past month
0,"Vertx Cutback Mens Tactical Shorts 11 inches, ...",62,2,14.00,Ships to Bangladesh,"Thu, Jun 15",10K+ bought in past month
1,"Storelli Jumper Socks by Floky, Biomechanical ...",49,"1,652",22.00,Ships to Bangladesh,"Thu, Jun 15",10K+ bought in past month
2,"Storelli Re-Charge Recovery Socks by Floky, Bi...",49,"259,463",30.00,Ships to Bangladesh,"Thu, Jun 15",6K+ bought in past month
3,Nike Men's Dri-Fit Training Cotton Cushioned C...,25,"52,469",26.00,Ships to Bangladesh,"Thu, Jun 15",10K+ bought in past month
4,"Gildan Men's Crew T-Shirts, Multipack, Style G...",42,"27,762",20.50,Ships to Bangladesh,"Thu, Jun 15",7K+ bought in past month
...,...,...,...,...,...,...,...
23948,Amazon Essentials Men's Corduroy Chino Pants,37,84,None,Ships to Bangladesh,"Wed, Jun 21",100+ bought in past month
23949,Paul Smith Men's Standard Short Long Zebra,NaN,84,None,Ships to Bangladesh,"Wed, Jun 21",100+ bought in past month
23950,Tommy Bahama Long Sleeve Indigo Beach Camp Shirt,NaN,84,None,Ships to Bangladesh,"Wed, Jun 21",100+ bought in past month
23951,Kanu Surf Men's South Beach Swim Trunks (Regul...,NaN,84,None,& Up,"Wed, Jun 21",100+ bought in past month
23952,"Volcom Men's Iconic Stone Fleece 20"" SweatShorts",NaN,84,None,& Up,"Wed, Jun 21",100+ bought in past month

#### How to find the row which have first meaningful value

In [64]:
some_df.Shipment.first_valid_index()

0

In [65]:
some_df_dict={
    'price':[62,49,49,25,42],
    'reviews':[2,1652,256463,52469,27762],
    'act_price':[14.0,22.0,30.0,26.0,20.5]
}

In [66]:
some_df_dict

{'price': [62, 49, 49, 25, 42],
 'reviews': [2, 1652, 256463, 52469, 27762],
 'act_price': [14.0, 22.0, 30.0, 26.0, 20.5]}

In [67]:
some_df_dict['price']

[62, 49, 49, 25, 42]

In [68]:
some_df['Price(Dollar)']

0         62
1         49
2         49
3         25
4         42
        ...
23948     37
23949    NaN
23950    NaN
23951    NaN
23952    NaN
Name: Price(Dollar), Length: 23953, dtype: object

In [69]:
type(some_df['Price(Dollar)'])

pandas.core.series.Series

In [70]:
some_df['Price(Dollar)'][4]

'42'

In [71]:
some_df.at[4,'Price(Dollar)']

'42'

In [72]:
some_df.Shipment

0        Ships to Bangladesh
1        Ships to Bangladesh
2        Ships to Bangladesh
3        Ships to Bangladesh
4        Ships to Bangladesh
                ...
23948    Ships to Bangladesh
23949    Ships to Bangladesh
23950    Ships to Bangladesh
23951                   & Up
23952                   & Up
Name: Shipment, Length: 23953, dtype: object

### If we change the data in the data frame which are derived from the same data frame then the original data will be changed

In [73]:
some_df=some_df[['Price(Dollar)','Number of reviews','Real price(Dollar)']]
some_df

      Price(Dollar) Number of reviews Real price(Dollar)
0                62                 2              14.00
1                49             1,652              22.00
2                49           259,463              30.00
3                25            52,469              26.00
4                42            27,762              20.50
...             ...               ...                ...
23948            37                84               None
23949           NaN                84               None
23950           NaN                84               None
23951           NaN                84               None
23952           NaN                84               None

[23953 rows x 3 columns]

### But if we copy the data to another data frame then the original value is not changed

In [74]:
another_data=some_df.copy()

In [75]:
another_data

      Price(Dollar) Number of reviews Real price(Dollar)
0                62                 2              14.00
1                49             1,652              22.00
2                49           259,463              30.00
3                25            52,469              26.00
4                42            27,762              20.50
...             ...               ...                ...
23948            37                84               None
23949           NaN                84               None
23950           NaN                84               None
23951           NaN                84               None
23952           NaN                84               None

[23953 rows x 3 columns]

#### Accessing a row

In [76]:
another_data.loc[4]

Price(Dollar)             42
Number of reviews     27,762
Real price(Dollar)     20.50
Name: 4, dtype: object

#### Accessing first 5 rows

In [77]:
another_data.head(5)

  Price(Dollar) Number of reviews Real price(Dollar)
0            62                 2              14.00
1            49             1,652              22.00
2            49           259,463              30.00
3            25            52,469              26.00
4            42            27,762              20.50

#### Accessing last 5 rows

In [78]:
some_df.tail(5)

      Price(Dollar) Number of reviews Real price(Dollar)
23948            37                84               None
23949           NaN                84               None
23950           NaN                84               None
23951           NaN                84               None
23952           NaN                84               None

In [79]:
some_df.at[23948,'Real price(Dollar)']

'None'

In [80]:
type(some_df.at[23948,'Real price(Dollar)'])

str

#### Accessing a range of rows

In [82]:
some_df.loc[0:4]

  Price(Dollar) Number of reviews Real price(Dollar)
0            62                 2              14.00
1            49             1,652              22.00
2            49           259,463              30.00
3            25            52,469              26.00
4            42            27,762              20.50

#### Sampling

In [83]:
some_df.sample(10)

      Price(Dollar) Number of reviews Real price(Dollar)
19541            18                 9               None
4224             61               454               None
18160            49                34              42.95
21158            17                16              24.99
12657            68                39               None
8868             35                16              55.00
15789             9                11               None
15486            30                 1               None
6749             45                28               None
3558             30                39               None

## Analyzing data from data frame

In [109]:
new_df=pd.read_csv('./data/amazon_car_accessories.csv',encoding='unicode_escape')

In [110]:
new_df

,Production Description,price,number_of_reviews,real_price_dollar,Free days,Shipment,Delivery Date,How many sell in past month,Stock update,Unnamed: 9
0,KINGLAKE 328 Feet Natural Jute Twine Best Arts...,10.00,29815.0,25.68,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",50+ bought in past week,Only 3 left in stock - order soon.,NaN
1,B-Air Grizzly Tarp Multi Purpose Waterproof Tarp,13.00,14370.0,38.12,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",50+ bought in past week,Only 2 left in stock - order soon.,NaN
2,"Kotap BB-6B Ball Bungee Cord, Heavy-Duty & Ver...",10.00,17801.0,19.99,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",50+ bought in past week,Only 2 left in stock - order soon.,NaN
3,MaxxHaul 50023 Hitch Tightener Anti Rattle Sta...,9.00,5987.0,50.99,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",50+ bought in past week,Only 2 left in stock - order soon.,NaN
4,Reese 21536 Drawbar 2 Inch Square and Ballmoun...,25.00,6190.0,62.99,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",50+ bought in past week,Only 2 left in stock - order soon.,NaN
...,...,...,...,...,...,...,...,...,...,...
9568,Warn 74924 (MTO) DRUM_WINCH_RT40,76.00,11.0,None,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",10% off coupon Details,Only 17 left in stock (more on the way).,NaN
9569,"Rugged Ridge 11580.10 Trailer Hitch, 2 inch; 0...",7.00,5.0,None,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",10% off coupon Details,Only 17 left in stock (more on the way).,NaN
9570,Gates 31633 OE Equivalent Fuel Tank Cap,71.00,5.0,None,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",10% off coupon Details,Only 17 left in stock (more on the way).,NaN
9571,BIG RED 2.5 Ton (5000 lb) Torin Low Profile Hy...,35.00,5.0,None,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",10% off coupon Details,Only 17 left in stock (more on the way).,NaN
9572,BIG RED ATRT2272CR Torin Manual Heavy Duty Han...,26.00,5.0,None,90 days FREE. Terms apply.,Ships to Bangladesh,"Mon, Jun 19",10% off coupon Details,Only 17 left in stock (more on the way).,NaN

In [111]:
new_df=new_df[['price','number_of_reviews','real_price_dollar']]
new_df

      price  number_of_reviews real_price_dollar
0     10.00            29815.0             25.68
1     13.00            14370.0             38.12
2     10.00            17801.0             19.99
3      9.00             5987.0             50.99
4     25.00             6190.0             62.99
...     ...                ...               ...
9568  76.00               11.0              None
9569   7.00                5.0              None
9570  71.00                5.0              None
9571  35.00                5.0              None
9572  26.00                5.0              None

[9573 rows x 3 columns]

In [117]:
type(new_df.price[0])

str